doc/rfc.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Contentlib</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-10 17:37:00 CEST"/>
<meta name="author" content="mjs"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Contentlib</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Protocol Flows </a>
<ul>
<li><a href="#sec-1.1">1.1 Exchange Authorization </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 UA-&gt;EX: Get Challenge Token From Server </a></li>
<li><a href="#sec-1.1.2">1.1.2 EX-&gt;UA: Return Challenge Token </a></li>
<li><a href="#sec-1.1.3">1.1.3 UA-&gt;SS: Store Challenge Token on Storage Server </a></li>
<li><a href="#sec-1.1.4">1.1.4 UA-&gt;EX: Prove Ownership of Storage Server </a></li>
<li><a href="#sec-1.1.5">1.1.5 EX-&gt;UA: Return Authorization Token </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Protocol Flows </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Exchange Authorization </h3>
<div class="outline-text-3" id="text-1.1">


<p>
A peer uses an exchange for receiving messages.  They could indicate
which exchange(s) they use in a well-known file in their remoteStorage
account.  Other peers send messages to an exchange the peer uses (with
a yet to be determined protocol), and the peer later retrieves them
from the exchange.
</p>
<p>
For retrieving messages addressed to an account from an exchange, the
peer's user agent needs an authorization token.  For getting an
authorization token, it needs to prove to the exchange that it owns
the remoteStorage location identified by the account.
</p>

</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> UA-&gt;EX: Get Challenge Token From Server </h4>
<div class="outline-text-4" id="text-1.1.1">


<p>
<code>POST http://exchange.example.net/challenge-token?acct=foo@example.com</code>
</p>
<p>
With this request, the user agent indicates that it wants a challenge
token, thereby starting the authorization process.
</p>
</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> EX-&gt;UA: Return Challenge Token </h4>
<div class="outline-text-4" id="text-1.1.2">


<p>
<code>bcf06fc78eb83da8bd8ac4f4aa20874d7bac5231</code>
</p>
<p>
The exchange returns the challenge token, an opaque string, to the
user agent, which it needs to store on the account's remoteStorage.
</p>
<p>
The exchange temporarily remembers the account and challenge token.
</p>
</div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> UA-&gt;SS: Store Challenge Token on Storage Server </h4>
<div class="outline-text-4" id="text-1.1.3">


<p>
<code>PUT http://example.com/~foo/challenge-tokens/69405782bacf0a1ecb5121973db58794db77dffd</code>
</p>
<p>
PUT content: <code>hash(bcf06fc78eb83da8bd8ac4f4aa20874d7bac5231)</code>
</p>
<p>
The user agent stores the challenge token on a location with a fresh
random name on the storage server.
</p>
<p>
The challenge token is one-way hashed, so that an attacker with read
access to the file cannot prove ownership to the exchange.
</p>
</div>

</div>

<div id="outline-container-1.1.4" class="outline-4">
<h4 id="sec-1.1.4"><span class="section-number-4">1.1.4</span> UA-&gt;EX: Prove Ownership of Storage Server </h4>
<div class="outline-text-4" id="text-1.1.4">





<pre class="example">POST http://exchange.example.net/prove-ownership
       ?acct=foo@example.com
       &amp;challenge=bcf06fc78eb83da8bd8ac4f4aa20874d7bac5231
       &amp;location=/challenge-tokens/69405782bacf0a1ecb5121973db58794db77dffd
</pre>




<p>
To prove ownership of the storage server, the user agent sends to the
exchange the account, the challenge token, and the location where it
has stored the hashed challenge token.
</p>
</div>

</div>

<div id="outline-container-1.1.5" class="outline-4">
<h4 id="sec-1.1.5"><span class="section-number-4">1.1.5</span> EX-&gt;UA: Return Authorization Token </h4>
<div class="outline-text-4" id="text-1.1.5">


<p>
<code>246f2841c18cd54de2809197da73c2e5fc6b965d</code>
</p>
<p>
The exchange checks that it has recently given out this challenge
token for this account, and fetches the hashed challenge token from
the peer-indicated location on the account, verifying that the hash
matches the challenge token.  If these conditions are true, it returns
the authorization token to the peer, giving it access to messages on
the exchange sent to it.
</p></div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: mjs
<a href="mailto:mjs@alfa.home">&lt;mjs@alfa.home&gt;</a>
</p>
<p class="date"> Date: 2012-08-10 17:37:00 CEST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
